tutorials/waterJet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
 | =========                 |                                                 |*
 | \\      /  F ield         | OpenFOAM                                        |
 |  \\    /   O peration     |                                                 |
 |   \\  /    A nd           |                                                 |
 |    \\/     M anipulation  |                                                 |
 \*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************* //

convertToMeters 1.0;

vertices
(
    // z = 0
    (0.000  0.000  0.000)   // 0
    (0.080  0.000  0.000)   // 1
    (0.082  0.000  0.000)   // 2
    (0.200  0.000  0.000)   // 3

    (0.000  0.010  0.000)   // 4
    (0.080  0.010  0.000)   // 5
    (0.082  0.010  0.000)   // 6
    (0.200  0.010  0.000)   // 7

    (0.000  0.180  0.000)   // 8
    (0.080  0.180  0.000)   // 9
    (0.082  0.180  0.000)   // 10
    (0.200  0.180  0.000)   // 11

    // z = 0.001
    (0.000  0.000  0.001)   // 12
    (0.080  0.000  0.001)   // 13
    (0.082  0.000  0.001)   // 14
    (0.200  0.000  0.001)   // 15

    (0.000  0.010  0.001)   // 16
    (0.080  0.010  0.001)   // 17
    (0.082  0.010  0.001)   // 18
    (0.200  0.010  0.001)   // 19

    (0.000  0.180  0.001)   // 20
    (0.080  0.180  0.001)   // 21
    (0.082  0.180  0.001)   // 22
    (0.200  0.180  0.001)   // 23
);

blocks
(
    // ============================================================
    // Near-wall region: 0 - 0.01 m
    // 30 cells in y, gradually increasing away from wall
    // First cell ~ 2e-6 m
    // Growth ratio ~ 1.272
    // ============================================================

    hex (0 1 5 4 12 13 17 16)
    (100 30 1)
    simpleGrading (1 35 1)

    hex (1 2 6 5 13 14 18 17)
    (3 30 1)
    simpleGrading (1 35 1)

    hex (2 3 7 6 14 15 19 18)
    (147 30 1)
    simpleGrading (1 35 1)


    // ============================================================
    // Outer region: 0.01 - 0.18 m
    // 114 almost uniform cells
    // ============================================================

    hex (4 5 9 8 16 17 21 20)
    (100 114 1)
    simpleGrading (1 1 1)

    hex (5 6 10 9 17 18 22 21)
    (3 114 1)
    simpleGrading (1 1 1)

    hex (6 7 11 10 18 19 23 22)
    (147 114 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 16 12)
            (4 8 20 16)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 15 19 7)
            (7 19 23 11)
        );
    }

    bottomLeft
    {
        type wall;
        faces
        (
            (0 12 13 1)
        );
    }

    waterInlet
    {
        type wall;
        faces
        (
            (1 13 14 2)
        );
    }

    bottomRight
    {
        type wall;
        faces
        (
            (2 14 15 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (10 11 23 22)
        );
    }

    emptyPlanes1
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)

            (1 2 6 5)
            (5 6 10 9)

            (2 3 7 6)
            (6 7 11 10)
        );
    }

    emptyPlanes2
    {
        type empty;
        faces
        (
            (12 16 17 13)
            (16 20 21 17)

            (13 17 18 14)
            (17 21 22 18)

            (14 18 19 15)
            (18 22 23 19)
        );
    }
);

// ************************************************************************* //
