tutorials/waterJet/constant/twoFluidProperties

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


epsilon         1.0e-5;
epsilonMin      1.0e-5;
epsilonMax      1.0e-4;

drag
{
    type        SchillerNaumann;
    dragCoeff   1.0;
    residualRe	1e-2;
}

// ************************************************************************* //
